** Step 1:- DATA Exploration & Leading**

In [2]:
#importing depencies
import pandas as pd
#mysql toolkit
import pymysql #this work as a connector to connect to mysql database 
from sqlalchemy import create_engine #this work as a toolkit to connect to mysql database and also to perform sql query in python

In [3]:
print(pd.__version__)

3.0.0

** import the dataset**

In [6]:
df=pd.read_csv(r"walmart-10k-sales-datasets\Walmart.csv",encoding_errors="ignore")
#to check the number of rows and columns in the dataset
df.shape

(10051, 11)

In [7]:
# to see the first 5 rows 
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [8]:
# gives you a quick statistical summary of the numerical columns in your DataFrame.
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [9]:
#gives the datatype of each column and non-null counts
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  str
 2   City            10051 non-null  str
 3   category        10051 non-null  str
 4   unit_price      10020 non-null  str
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  str
 7   time            10051 non-null  str
 8   payment_method  10051 non-null  str
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), str(7)
memory usage: 863.9 KB

In [11]:
#to count all the duplicate rows in the dataset
df.duplicated().sum()

np.int64(0)

In [10]:
#command to remove the duplicates 
df.drop_duplicates(inplace=True)

In [12]:
# after removing the duplicate values the no of rows reduces
df.shape

(10000, 11)

In [13]:
#tells which column have how many null values
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [14]:
# to remove the null values we are deleting the entire row which have nul values
df.dropna(inplace=True)

In [17]:
# to change the datatype of the column 
df['unit_price'].astype('float')

0       74.69
1       15.28
2       46.33
3       58.22
4       86.31
        ...
9995    37.00
9996    58.00
9997    52.00
9998    79.00
9999    62.00
Name: unit_price, Length: 9969, dtype: float64

In [16]:
#to remove the $ sign from the unit price column and change the datatype to float
df['unit_price']=df['unit_price'].str.replace('$','').astype('float')

In [18]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [19]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [20]:

df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='str')

In [22]:
#to make a new column using price and quantity column
df['total_price']=df['unit_price'] * df['quantity']

In [23]:
#mysql
host='localhost'
port=3306
user='root'
password='Suhani@015'

In [24]:
df.to_csv('walmart_sales.csv',index=False)

In [30]:

#to make connect with python and mysql database we need to create a engine
#create_engine("mysql+pymysql://username:password@host:port/database_name")
engine_mysql =  create_engine("mysql+pymysql://root:Suhani%40015@localhost:3306/walmart_db")

try:
    engine_mysql
    print("Connection to MySQL database successful!")
except Exception as e:
    print(f"Error connecting to MySQL database: {e}")

Connection to MySQL database successful!

In [31]:
df.to_sql(name='walmart',con=engine_mysql,if_exists='append',index=False)

9969

In [39]:
import cryptography
print("OK")

OK